## Pandas

In [2]:
import pandas as pd

In [3]:
grades_df = pd.read_csv('df_example.csv')
print(type(grades_df))

<class 'pandas.core.frame.DataFrame'>

In [ ]:
grades_df.shape

In [4]:
grades_df.head()

   Nombre  Nota  Edad
0   María    16    25
1    Juan    14    22
2  Andrea    18    28
3  Carlos    12    26
4   Laura    15    24

In [ ]:
grades_df.tail()

In [ ]:
grades_df.dtypes

In [ ]:
grades_df["Nota"]
type(grades_df["Nota"])

In [ ]:
grades_df["Nota"][0]

In [10]:
grades_df.iloc[4]

Nota    15
Edad    24
Name: Laura, dtype: int64

In [8]:
grades_df.head()

        Nota  Edad
Nombre
María     16    25
Juan      14    22
Andrea    18    28
Carlos    12    26
Laura     15    24

In [7]:
grades_df.set_index("Nombre", inplace=True)

In [11]:
grades_df.loc["Juan"]

Nota    14
Edad    22
Name: Juan, dtype: int64